---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.AnalyticalModelFailures.UnableToUpgradeAnalyticalElementGeometry
source: html/fb2f23f8-b30e-8450-b2ae-5807c035c9a7.htm
---
# Autodesk.Revit.DB.BuiltInFailures.AnalyticalModelFailures.UnableToUpgradeAnalyticalElementGeometry Property

Unable to upgrade analytical element with incorrect geometry. To keep the elements, open Revit 2022 and correct the elements.

## Syntax (C#)
```csharp
public static FailureDefinitionId UnableToUpgradeAnalyticalElementGeometry { get; }
```